<a href="https://colab.research.google.com/github/Yogesh-8998/World-Bank-Global-Education-Analysis/blob/main/CH_%7BYogesh_Patil%7D_%7B_World_Bank_Global_Education_Analysis_Capstone_Project%7D.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## <b> The World Bank EdStats All Indicator Query holds over 4,000 internationally comparable indicators that describe education access, progression, completion, literacy, teachers, population, and expenditures.The indicators cover the education cycle from pre-primary to vocational and tertiary education and also holds learning outcome data from international and regional learning assessments (e.g. PISA, TIMSS, PIRLS), equity data from household surveys, and projection/attainment data. </b>

## <b> Explore and analyze the data to identify variation of indicators across the globe, which countries are more alike and different. Feel free to add more extensive analyses and details.</b>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [10]:
import pandas as pd
import numpy as np

In [11]:
df1 = pd.read_csv('/content/drive/MyDrive/Almabetter /Capstone Project/EdStatsCountry-Series.csv')
df2 = pd.read_csv('/content/drive/MyDrive/Almabetter /Capstone Project/EdStatsCountry.csv')
df3 = pd.read_csv('/content/drive/MyDrive/Almabetter /Capstone Project/EdStatsFootNote.csv')
df4 =pd.read_csv('/content/drive/MyDrive/Almabetter /Capstone Project/EdStatsSeries.csv')
df5 =pd.read_csv('/content/drive/MyDrive/Almabetter /Capstone Project/EdStatsData.csv')

In [12]:
df1.head()

  CountryCode  ... Unnamed: 3
0         ABW  ...        NaN
1         ABW  ...        NaN
2         AFG  ...        NaN
3         AFG  ...        NaN
4         AFG  ...        NaN

[5 rows x 4 columns]

In [13]:
df2.head(2)

  Country Code   Short Name  ... Latest water withdrawal data Unnamed: 31
0          ABW        Aruba  ...                          NaN         NaN
1          AFG  Afghanistan  ...                         2000         NaN

[2 rows x 32 columns]

In [14]:
df3.head()

  CountryCode      SeriesCode    Year          DESCRIPTION  Unnamed: 4
0         ABW  SE.PRE.ENRL.FE  YR2001  Country estimation.         NaN
1         ABW  SE.TER.TCHR.FE  YR2005  Country estimation.         NaN
2         ABW  SE.PRE.TCHR.FE  YR2000  Country estimation.         NaN
3         ABW  SE.SEC.ENRL.GC  YR2004  Country estimation.         NaN
4         ABW     SE.PRE.TCHR  YR2006  Country estimation.         NaN

In [15]:
df4.head(2)

           Series Code       Topic  ... License Type Unnamed: 20
0  BAR.NOED.1519.FE.ZS  Attainment  ...          NaN         NaN
1     BAR.NOED.1519.ZS  Attainment  ...          NaN         NaN

[2 rows x 21 columns]

In [16]:
df5.head(2)

  Country Name Country Code  ... 2100 Unnamed: 69
0   Arab World          ARB  ...  NaN         NaN
1   Arab World          ARB  ...  NaN         NaN

[2 rows x 70 columns]

In [17]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 613 entries, 0 to 612
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CountryCode  613 non-null    object
 1   SeriesCode   613 non-null    object
 2   DESCRIPTION  613 non-null    object
 3   Unnamed: 3   0 non-null      float64
dtypes: float64(1), object(3)
memory usage: 19.3+ KB

In [18]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 241 entries, 0 to 240
Data columns (total 32 columns):
 #   Column                                             Non-Null Count  Dtype
---  ------                                             --------------  -----
 0   Country Code                                       241 non-null    object
 1   Short Name                                         241 non-null    object
 2   Table Name                                         241 non-null    object
 3   Long Name                                          241 non-null    object
 4   2-alpha code                                       238 non-null    object
 5   Currency Unit                                      215 non-null    object
 6   Special Notes                                      145 non-null    object
 7   Region                                             214 non-null    object
 8   Income Group                                       214 non-null    object
 9   WB-2 code                                          240 non-null    object
 10  National accounts base year                        205 non-null    object
 11  National accounts reference year                   32 non-null     float64
 12  SNA price valuation                                197 non-null    object
 13  Lending category                                   144 non-null    object
 14  Other groups                                       58 non-null     object
 15  System of National Accounts                        215 non-null    object
 16  Alternative conversion factor                      47 non-null     object
 17  PPP survey year                                    145 non-null    object
 18  Balance of Payments Manual in use                  181 non-null    object
 19  External debt Reporting status                     124 non-null    object
 20  System of trade                                    200 non-null    object
 21  Government Accounting concept                      161 non-null    object
 22  IMF data dissemination standard                    181 non-null    object
 23  Latest population census                           213 non-null    object
 24  Latest household survey                            141 non-null    object
 25  Source of most recent Income and expenditure data  160 non-null    object
 26  Vital registration complete                        111 non-null    object
 27  Latest agricultural census                         142 non-null    object
 28  Latest industrial data                             107 non-null    float64
 29  Latest trade data                                  185 non-null    float64
 30  Latest water withdrawal data                       179 non-null    object
 31  Unnamed: 31                                        0 non-null      float64
dtypes: float64(4), object(28)
memory usage: 60.4+ KB

In [19]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 643638 entries, 0 to 643637
Data columns (total 5 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   CountryCode  643638 non-null  object
 1   SeriesCode   643638 non-null  object
 2   Year         643638 non-null  object
 3   DESCRIPTION  643638 non-null  object
 4   Unnamed: 4   0 non-null       float64
dtypes: float64(1), object(4)
memory usage: 24.6+ MB

In [20]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3665 entries, 0 to 3664
Data columns (total 21 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   Series Code                          3665 non-null   object
 1   Topic                                3665 non-null   object
 2   Indicator Name                       3665 non-null   object
 3   Short definition                     2156 non-null   object
 4   Long definition                      3665 non-null   object
 5   Unit of measure                      0 non-null      float64
 6   Periodicity                          99 non-null     object
 7   Base Period                          314 non-null    object
 8   Other notes                          552 non-null    object
 9   Aggregation method                   47 non-null     object
 10  Limitations and exceptions           14 non-null     object
 11  Notes from original source           0 non-null      float64
 12  General comments                     14 non-null     object
 13  Source                               3665 non-null   object
 14  Statistical concept and methodology  23 non-null     object
 15  Development relevance                3 non-null      object
 16  Related source links                 215 non-null    object
 17  Other web links                      0 non-null      float64
 18  Related indicators                   0 non-null      float64
 19  License Type                         0 non-null      float64
 20  Unnamed: 20                          0 non-null      float64
dtypes: float64(6), object(15)
memory usage: 601.4+ KB

In [21]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 886930 entries, 0 to 886929
Data columns (total 70 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Country Name    886930 non-null  object
 1   Country Code    886930 non-null  object
 2   Indicator Name  886930 non-null  object
 3   Indicator Code  886930 non-null  object
 4   1970            72288 non-null   float64
 5   1971            35537 non-null   float64
 6   1972            35619 non-null   float64
 7   1973            35545 non-null   float64
 8   1974            35730 non-null   float64
 9   1975            87306 non-null   float64
 10  1976            37483 non-null   float64
 11  1977            37574 non-null   float64
 12  1978            37576 non-null   float64
 13  1979            36809 non-null   float64
 14  1980            89122 non-null   float64
 15  1981            38777 non-null   float64
 16  1982            37511 non-null   float64
 17  1983            38460 non-null   float64
 18  1984            38606 non-null   float64
 19  1985            90296 non-null   float64
 20  1986            39372 non-null   float64
 21  1987            38641 non-null   float64
 22  1988            38552 non-null   float64
 23  1989            37540 non-null   float64
 24  1990            124405 non-null  float64
 25  1991            74437 non-null   float64
 26  1992            75543 non-null   float64
 27  1993            75793 non-null   float64
 28  1994            77462 non-null   float64
 29  1995            131361 non-null  float64
 30  1996            76807 non-null   float64
 31  1997            73453 non-null   float64
 32  1998            84914 non-null   float64
 33  1999            118839 non-null  float64
 34  2000            176676 non-null  float64
 35  2001            123509 non-null  float64
 36  2002            124205 non-null  float64
 37  2003            130363 non-null  float64
 38  2004            128814 non-null  float64
 39  2005            184108 non-null  float64
 40  2006            140312 non-null  float64
 41  2007            137272 non-null  float64
 42  2008            134387 non-null  float64
 43  2009            142108 non-null  float64
 44  2010            242442 non-null  float64
 45  2011            146012 non-null  float64
 46  2012            147264 non-null  float64
 47  2013            137509 non-null  float64
 48  2014            113789 non-null  float64
 49  2015            131058 non-null  float64
 50  2016            16460 non-null   float64
 51  2017            143 non-null     float64
 52  2020            51436 non-null   float64
 53  2025            51436 non-null   float64
 54  2030            51436 non-null   float64
 55  2035            51436 non-null   float64
 56  2040            51436 non-null   float64
 57  2045            51436 non-null   float64
 58  2050            51436 non-null   float64
 59  2055            51436 non-null   float64
 60  2060            51436 non-null   float64
 61  2065            51436 non-null   float64
 62  2070            51436 non-null   float64
 63  2075            51436 non-null   float64
 64  2080            51436 non-null   float64
 65  2085            51436 non-null   float64
 66  2090            51436 non-null   float64
 67  2095            51436 non-null   float64
 68  2100            51436 non-null   float64
 69  Unnamed: 69     0 non-null       float64
dtypes: float64(66), object(4)
memory usage: 473.7+ MB

In [22]:
# df4['Indicator Name'] = pd.np.where(df1.Topic.str.contains('TIMSS'),df1['Indicator Name'].str.split(':').str[0], ' ')

**Variation in performance of Females and Males in PSIA & TIMSS across years for PISA 2000 to 2015 & TIMSS 1995 to 2015**

In [23]:
a = df4.loc[:, 'Indicator Name']
a.head(5)

0    Barro-Lee: Percentage of female population age...
1    Barro-Lee: Percentage of population age 15-19 ...
2    Barro-Lee: Percentage of female population age...
3    Barro-Lee: Percentage of population age 15+ wi...
4    Barro-Lee: Percentage of female population age...
Name: Indicator Name, dtype: object

In [24]:
df_data_subset = df5.drop(df5.iloc[:, 4:34],axis=1)
# df_data_subset.head(1)
df_data_subset = df_data_subset.drop(df_data_subset.iloc[:, 20:], axis=1)
df_data_subset.head(1)

  Country Name Country Code  ... 2014 2015
0   Arab World          ARB  ...  NaN  NaN

[1 rows x 20 columns]

In [25]:
df1 = pd.merge(df_data_subset, df2[['Country Code', 'Region', 'Income Group']], how = 'left', on = 'Country Code').reset_index(drop=True)
df1.head(3)

  Country Name Country Code  ... Region Income Group
0   Arab World          ARB  ...    NaN          NaN
1   Arab World          ARB  ...    NaN          NaN
2   Arab World          ARB  ...    NaN          NaN

[3 rows x 22 columns]

In [26]:
df1.groupby(['Indicator Name', 'Country Name']).size()

Indicator Name                                                Country Name
Adjusted net enrolment rate, lower secondary, both sexes (%)  Afghanistan           1
                                                              Albania               1
                                                              Algeria               1
                                                              American Samoa        1
                                                              Andorra               1
                                                                                   ..
Youth literacy rate, population 15-24 years, male (%)         West Bank and Gaza    1
                                                              World                 1
                                                              Yemen, Rep.           1
                                                              Zambia                1
                                                              Zimbabwe              1
Length: 886930, dtype: int64

In [27]:
df1.groupby(['Region', 'Country Name']).size()

Region               Country Name
East Asia & Pacific  American Samoa       3665
                     Australia            3665
                     Brunei Darussalam    3665
                     Cambodia             3665
                     China                3665
                                          ...
Sub-Saharan Africa   Tanzania             3665
                     Togo                 3665
                     Uganda               3665
                     Zambia               3665
                     Zimbabwe             3665
Length: 214, dtype: int64

In [28]:
b = df1[df1['Indicator Name'].str.contains('PISA')]['Indicator Name'].unique()
b

array(['PISA: 15-year-olds by mathematics proficiency level (%). Below Level 1',
       'PISA: 15-year-olds by mathematics proficiency level (%). Level 1',
       'PISA: 15-year-olds by mathematics proficiency level (%). Level 2',
       'PISA: 15-year-olds by mathematics proficiency level (%). Level 3',
       'PISA: 15-year-olds by mathematics proficiency level (%). Level 4',
       'PISA: 15-year-olds by mathematics proficiency level (%). Level 5',
       'PISA: 15-year-olds by mathematics proficiency level (%). Level 6',
       'PISA: 15-year-olds by reading proficiency level (%). Below Level 1B',
       'PISA: 15-year-olds by reading proficiency level (%). Level 1A',
       'PISA: 15-year-olds by reading proficiency level (%). Level 1B',
       'PISA: 15-year-olds by reading proficiency level (%). Level 2',
       'PISA: 15-year-olds by reading proficiency level (%). Level 3',
       'PISA: 15-year-olds by reading proficiency level (%). Level 4',
       'PISA: 15-year-olds by reading proficiency level (%). Level 5',
       'PISA: 15-year-olds by reading proficiency level (%). Level 6',
       'PISA: 15-year-olds by science proficiency level (%). Below Level 1B',
       'PISA: 15-year-olds by science proficiency level (%). Level 1A',
       'PISA: 15-year-olds by science proficiency level (%). Level 1B',
       'PISA: 15-year-olds by science proficiency level (%). Level 2',
       'PISA: 15-year-olds by science proficiency level (%). Level 3',
       'PISA: 15-year-olds by science proficiency level (%). Level 4',
       'PISA: 15-year-olds by science proficiency level (%). Level 5',
       'PISA: 15-year-olds by science proficiency level (%). Level 6',
       'PISA: Distribution of Mathematics Scores: 10th Percentile Score',
       'PISA: Distribution of Mathematics Scores: 25th Percentile Score',
       'PISA: Distribution of Mathematics Scores: 50th Percentile Score',
       'PISA: Distribution of Mathematics Scores: 5th Percentile Score',
       'PISA: Distribution of Mathematics Scores: 75th Percentile Score',
       'PISA: Distribution of Mathematics Scores: 90th Percentile Score',
       'PISA: Distribution of Mathematics Scores: 95th Percentile Score',
       'PISA: Distribution of Reading Scores: 10th Percentile Score',
       'PISA: Distribution of Reading Scores: 25th Percentile Score',
       'PISA: Distribution of Reading Scores: 50th Percentile Score',
       'PISA: Distribution of Reading Scores: 5th Percentile Score',
       'PISA: Distribution of Reading Scores: 75th Percentile Score',
       'PISA: Distribution of Reading Scores: 90th Percentile Score',
       'PISA: Distribution of Reading Scores: 95th Percentile Score',
       'PISA: Distribution of Science Scores: 10th Percentile Score',
       'PISA: Distribution of Science Scores: 25th Percentile Score',
       'PISA: Distribution of Science Scores: 50th Percentile Score',
       'PISA: Distribution of Science Scores: 5th Percentile Score',
       'PISA: Distribution of Science Scores: 75th Percentile Score',
       'PISA: Distribution of Science Scores: 90th Percentile Score',
       'PISA: Distribution of Science Scores: 95th Percentile Score',
       'PISA: Female 15-year-olds by mathematics proficiency level (%). Below Level 1',
       'PISA: Female 15-year-olds by mathematics proficiency level (%). Level 1',
       'PISA: Female 15-year-olds by mathematics proficiency level (%). Level 2',
       'PISA: Female 15-year-olds by mathematics proficiency level (%). Level 3',
       'PISA: Female 15-year-olds by mathematics proficiency level (%). Level 4',
       'PISA: Female 15-year-olds by mathematics proficiency level (%). Level 5',
       'PISA: Female 15-year-olds by mathematics proficiency level (%). Level 6',
       'PISA: Female 15-year-olds by reading proficiency level (%). Below Level 1B',
       'PISA: Female 15-year-olds by reading proficiency level (%). Level 1A',
       'PISA: Female 15-year-olds by reading proficiency level (%). Level 1B',
       'PISA: Female 15-year-olds by reading proficiency level (%). Level 2',
       'PISA: Female 15-year-olds by reading proficiency level (%). Level 3',
       'PISA: Female 15-year-olds by reading proficiency level (%). Level 4',
       'PISA: Female 15-year-olds by reading proficiency level (%). Level 5',
       'PISA: Female 15-year-olds by reading proficiency level (%). Level 6',
       'PISA: Female 15-year-olds by science proficiency level (%). Below Level 1B',
       'PISA: Female 15-year-olds by science proficiency level (%). Level 1A',
       'PISA: Female 15-year-olds by science proficiency level (%). Level 1B',
       'PISA: Female 15-year-olds by science proficiency level (%). Level 2',
       'PISA: Female 15-year-olds by science proficiency level (%). Level 3',
       'PISA: Female 15-year-olds by science proficiency level (%). Level 4',
       'PISA: Female 15-year-olds by science proficiency level (%). Level 5',
       'PISA: Female 15-year-olds by science proficiency level (%). Level 6',
       'PISA: Male 15-year-olds by mathematics proficiency level (%). Below Level 1',
       'PISA: Male 15-year-olds by mathematics proficiency level (%). Level 1',
       'PISA: Male 15-year-olds by mathematics proficiency level (%). Level 2',
       'PISA: Male 15-year-olds by mathematics proficiency level (%). Level 3',
       'PISA: Male 15-year-olds by mathematics proficiency level (%). Level 4',
       'PISA: Male 15-year-olds by mathematics proficiency level (%). Level 5',
       'PISA: Male 15-year-olds by mathematics proficiency level (%). Level 6',
       'PISA: Male 15-year-olds by reading proficiency level (%). Below Level 1B',
       'PISA: Male 15-year-olds by reading proficiency level (%). Level 1A',
       'PISA: Male 15-year-olds by reading proficiency level (%). Level 1B',
       'PISA: Male 15-year-olds by reading proficiency level (%). Level 2',
       'PISA: Male 15-year-olds by reading proficiency level (%). Level 3',
       'PISA: Male 15-year-olds by reading proficiency level (%). Level 4',
       'PISA: Male 15-year-olds by reading proficiency level (%). Level 5',
       'PISA: Male 15-year-olds by reading proficiency level (%). Level 6',
       'PISA: Male 15-year-olds by science proficiency level (%). Below Level 1B',
       'PISA: Male 15-year-olds by science proficiency level (%). Level 1A',
       'PISA: Male 15-year-olds by science proficiency level (%). Level 1B',
       'PISA: Male 15-year-olds by science proficiency level (%). Level 2',
       'PISA: Male 15-year-olds by science proficiency level (%). Level 3',
       'PISA: Male 15-year-olds by science proficiency level (%). Level 4',
       'PISA: Male 15-year-olds by science proficiency level (%). Level 5',
       'PISA: Male 15-year-olds by science proficiency level (%). Level 6',
       'PISA: Mean performance on the mathematics scale',
       'PISA: Mean performance on the mathematics scale. Female',
       'PISA: Mean performance on the mathematics scale. Male',
       'PISA: Mean performance on the reading scale',
       'PISA: Mean performance on the reading scale. Female',
       'PISA: Mean performance on the reading scale. Male',
       'PISA: Mean performance on the science scale',
       'PISA: Mean performance on the science scale. Female',
       'PISA: Mean performance on the science scale. Male'], dtype=object)

In [29]:
df1[df1['Indicator Name'].str.contains('TIMSS')]['Indicator Name'].unique()

array(['TIMSS: Distribution of 4th Grade Mathematics Scores: 10th Percentile Score',
       'TIMSS: Distribution of 4th Grade Mathematics Scores: 25th Percentile Score',
       'TIMSS: Distribution of 4th Grade Mathematics Scores: 50th Percentile Score',
       'TIMSS: Distribution of 4th Grade Mathematics Scores: 5th Percentile Score',
       'TIMSS: Distribution of 4th Grade Mathematics Scores: 75th Percentile Score',
       'TIMSS: Distribution of 4th Grade Mathematics Scores: 90th Percentile Score',
       'TIMSS: Distribution of 4th Grade Mathematics Scores: 95th Percentile Score',
       'TIMSS: Distribution of 4th Grade Science Scores: 10th Percentile Score',
       'TIMSS: Distribution of 4th Grade Science Scores: 25th Percentile Score',
       'TIMSS: Distribution of 4th Grade Science Scores: 50th Percentile Score',
       'TIMSS: Distribution of 4th Grade Science Scores: 5th Percentile Score',
       'TIMSS: Distribution of 4th Grade Science Scores: 75th Percentile Score',
       'TIMSS: Distribution of 4th Grade Science Scores: 90th Percentile Score',
       'TIMSS: Distribution of 4th Grade Science Scores: 95th Percentile Score',
       'TIMSS: Distribution of 8th Grade Mathematics Scores: 10th Percentile Score',
       'TIMSS: Distribution of 8th Grade Mathematics Scores: 25th Percentile Score',
       'TIMSS: Distribution of 8th Grade Mathematics Scores: 50th Percentile Score',
       'TIMSS: Distribution of 8th Grade Mathematics Scores: 5th Percentile Score',
       'TIMSS: Distribution of 8th Grade Mathematics Scores: 75th Percentile Score',
       'TIMSS: Distribution of 8th Grade Mathematics Scores: 90th Percentile Score',
       'TIMSS: Distribution of 8th Grade Mathematics Scores: 95th Percentile Score',
       'TIMSS: Distribution of 8th Grade Science Scores: 10th Percentile Score',
       'TIMSS: Distribution of 8th Grade Science Scores: 25th Percentile Score',
       'TIMSS: Distribution of 8th Grade Science Scores: 50th Percentile Score',
       'TIMSS: Distribution of 8th Grade Science Scores: 5th Percentile Score',
       'TIMSS: Distribution of 8th Grade Science Scores: 75th Percentile Score',
       'TIMSS: Distribution of 8th Grade Science Scores: 90th Percentile Score',
       'TIMSS: Distribution of 8th Grade Science Scores: 95th Percentile Score',
       'TIMSS: Eighth grade students reaching the advanced international benchmark of mathematics achievement (%)',
       'TIMSS: Eighth grade students reaching the advanced international benchmark of science achievement (%)',
       'TIMSS: Eighth grade students reaching the high international benchmark of mathematics achievement (%)',
       'TIMSS: Eighth grade students reaching the high international benchmark of science achievement (%)',
       'TIMSS: Eighth grade students reaching the intermediate international benchmark of mathematics achievement (%)',
       'TIMSS: Eighth grade students reaching the intermediate international benchmark of science achievement (%)',
       'TIMSS: Eighth grade students reaching the low international benchmark of mathematics achievement (%)',
       'TIMSS: Eighth grade students reaching the low international benchmark of science achievement (%)',
       'TIMSS: Eighth grade students who did not reach the low international benchmark of mathematics achievement (%)',
       'TIMSS: Eighth grade students who did not reach the low international benchmark of science achievement (%)',
       'TIMSS: Female 4th grade students reaching the advanced international benchmark of mathematics achievement (%)',
       'TIMSS: Female 4th grade students reaching the advanced international benchmark of science achievement (%)',
       'TIMSS: Female 4th grade students reaching the high international benchmark of mathematics achievement (%)',
       'TIMSS: Female 4th grade students reaching the high international benchmark of science achievement (%)',
       'TIMSS: Female 4th grade students reaching the intermediate international benchmark of mathematics achievement (%)',
       'TIMSS: Female 4th grade students reaching the intermediate international benchmark of science achievement (%)',
       'TIMSS: Female 4th grade students reaching the low international benchmark of mathematics achievement (%)',
       'TIMSS: Female 4th grade students reaching the low international benchmark of science achievement (%)',
       'TIMSS: Female 4th grade students who did not reach the low international benchmark of mathematics achievement (%)',
       'TIMSS: Female 4th grade students who did not reach the low international benchmark of science achievement (%)',
       'TIMSS: Female 8th grade students reaching the advanced international benchmark of mathematics achievement (%)',
       'TIMSS: Female 8th grade students reaching the advanced international benchmark of science achievement (%)',
       'TIMSS: Female 8th grade students reaching the high international benchmark of mathematics achievement (%)',
       'TIMSS: Female 8th grade students reaching the high international benchmark of science achievement (%)',
       'TIMSS: Female 8th grade students reaching the intermediate international benchmark of mathematics achievement (%)',
       'TIMSS: Female 8th grade students reaching the intermediate international benchmark of science achievement (%)',
       'TIMSS: Female 8th grade students reaching the low international benchmark of mathematics achievement (%)',
       'TIMSS: Female 8th grade students reaching the low international benchmark of science achievement (%)',
       'TIMSS: Female 8th grade students who did not reach the low international benchmark of mathematics achievement (%)',
       'TIMSS: Female 8th grade students who did not reach the low international benchmark of science achievement (%)',
       'TIMSS: Fourth grade students reaching the advanced international benchmark of mathematics achievement (%)',
       'TIMSS: Fourth grade students reaching the advanced international benchmark of science achievement (%)',
       'TIMSS: Fourth grade students reaching the high international benchmark of mathematics achievement (%)',
       'TIMSS: Fourth grade students reaching the high international benchmark of science achievement (%)',
       'TIMSS: Fourth grade students reaching the intermediate international benchmark of mathematics achievement (%)',
       'TIMSS: Fourth grade students reaching the intermediate international benchmark of science achievement (%)',
       'TIMSS: Fourth grade students reaching the low international benchmark of mathematics achievement (%)',
       'TIMSS: Fourth grade students reaching the low international benchmark of science achievement (%)',
       'TIMSS: Fourth grade students who did not reach the low international benchmark of mathematics achievement (%)',
       'TIMSS: Fourth grade students who did not reach the low international benchmark of science achievement (%)',
       'TIMSS: Male 4th grade students reaching the advanced international benchmark of mathematics achievement (%)',
       'TIMSS: Male 4th grade students reaching the advanced international benchmark of science achievement (%)',
       'TIMSS: Male 4th grade students reaching the high international benchmark of mathematics achievement (%)',
       'TIMSS: Male 4th grade students reaching the high international benchmark of science achievement (%)',
       'TIMSS: Male 4th grade students reaching the intermediate international benchmark of mathematics achievement (%)',
       'TIMSS: Male 4th grade students reaching the intermediate international benchmark of science achievement (%)',
       'TIMSS: Male 4th grade students reaching the low international benchmark of mathematics achievement (%)',
       'TIMSS: Male 4th grade students reaching the low international benchmark of science achievement (%)',
       'TIMSS: Male 4th grade students who did not reach the low international benchmark of mathematics achievement (%)',
       'TIMSS: Male 4th grade students who did not reach the low international benchmark of science achievement (%)',
       'TIMSS: Male 8th grade students reaching the advanced international benchmark of mathematics achievement (%)',
       'TIMSS: Male 8th grade students reaching the advanced international benchmark of science achievement (%)',
       'TIMSS: Male 8th grade students reaching the high international benchmark of mathematics achievement (%)',
       'TIMSS: Male 8th grade students reaching the high international benchmark of science achievement (%)',
       'TIMSS: Male 8th grade students reaching the intermediate international benchmark of mathematics achievement (%)',
       'TIMSS: Male 8th grade students reaching the intermediate international benchmark of science achievement (%)',
       'TIMSS: Male 8th grade students reaching the low international benchmark of mathematics achievement (%)',
       'TIMSS: Male 8th grade students reaching the low international benchmark of science achievement (%)',
       'TIMSS: Male 8th grade students who did not reach the low international benchmark of mathematics achievement (%)',
       'TIMSS: Male 8th grade students who did not reach the low international benchmark of science achievement (%)',
       'TIMSS: Mean performance on the mathematics scale for eighth grade students, female',
       'TIMSS: Mean performance on the mathematics scale for eighth grade students, male',
       'TIMSS: Mean performance on the mathematics scale for eighth grade students, total',
       'TIMSS: Mean performance on the mathematics scale for fourth grade students, female',
       'TIMSS: Mean performance on the mathematics scale for fourth grade students, male',
       'TIMSS: Mean performance on the mathematics scale for fourth grade students, total',
       'TIMSS: Mean performance on the science scale for eighth grade students, female',
       'TIMSS: Mean performance on the science scale for eighth grade students, male',
       'TIMSS: Mean performance on the science scale for eighth grade students, total',
       'TIMSS: Mean performance on the science scale for fourth grade students, female',
       'TIMSS: Mean performance on the science scale for fourth grade students, male',
       'TIMSS: Mean performance on the science scale for fourth grade students, total'],
      dtype=object)

In [30]:
abc = df1.loc[df1['Indicator Name'].isin(['PISA'])][['Indicator Code', '2000',	'2001',	'2002',	'2003',	'2004']]
abc

Empty DataFrame
Columns: [Indicator Code, 2000, 2001, 2002, 2003, 2004]
Index: []

Relationship between internet users and literacy rate

In [31]:
df_data_subset[df_data_subset['Indicator Name'].str.contains('literacy')]['Indicator Name'].unique()

array(['Adult literacy rate, population 15+ years, both sexes (%)',
       'Adult literacy rate, population 15+ years, female (%)',
       'Adult literacy rate, population 15+ years, gender parity index (GPI)',
       'Adult literacy rate, population 15+ years, male (%)',
       'Elderly literacy rate, population 65+ years, both sexes (%)',
       'Elderly literacy rate, population 65+ years, female (%)',
       'Elderly literacy rate, population 65+ years, gender parity index (GPI)',
       'Elderly literacy rate, population 65+ years, male (%)',
       'PIAAC: Adults by literacy proficiency level (%). Below Level 1',
       'PIAAC: Adults by literacy proficiency level (%). Level 1',
       'PIAAC: Adults by literacy proficiency level (%). Level 2',
       'PIAAC: Adults by literacy proficiency level (%). Level 3',
       'PIAAC: Adults by literacy proficiency level (%). Level 4',
       'PIAAC: Adults by literacy proficiency level (%). Level 5',
       'PIAAC: Female adults by literacy proficiency level (%). Below Level 1',
       'PIAAC: Female adults by literacy proficiency level (%). Level 1',
       'PIAAC: Female adults by literacy proficiency level (%). Level 2',
       'PIAAC: Female adults by literacy proficiency level (%). Level 3',
       'PIAAC: Female adults by literacy proficiency level (%). Level 4 & 5',
       'PIAAC: Male adults by literacy proficiency level (%). Below Level 1',
       'PIAAC: Male adults by literacy proficiency level (%). Level 1',
       'PIAAC: Male adults by literacy proficiency level (%). Level 2',
       'PIAAC: Male adults by literacy proficiency level (%). Level 3',
       'PIAAC: Male adults by literacy proficiency level (%). Level 4 & 5',
       'PIAAC: Young adults by literacy proficiency level (%). Below Level 1',
       'PIAAC: Young adults by literacy proficiency level (%). Level 1',
       'PIAAC: Young adults by literacy proficiency level (%). Level 2',
       'PIAAC: Young adults by literacy proficiency level (%). Level 3',
       'PIAAC: Young adults by literacy proficiency level (%). Level 4 & 5',
       'Youth literacy rate, population 15-24 years, both sexes (%)',
       'Youth literacy rate, population 15-24 years, female (%)',
       'Youth literacy rate, population 15-24 years, gender parity index (GPI)',
       'Youth literacy rate, population 15-24 years, male (%)'],
      dtype=object)

In [32]:
df1[df1['Indicator Name'].str.contains('Internet')]['Indicator Name'].unique()

array(['Internet users (per 100 people)'], dtype=object)

In [33]:
import matplotlib.pyplot as plt
%matplotlib inline